Repository: xccui/SPWAF-Translation
Catalog: omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: This will generate a Maven project for Flink 1.7.1 in a folder called flink-scala-project.
zh_cn: 上述命令会在flink-scala-project文件夹内生成一个Flink 1.7.1版本的Maven项目。

source: This will initialize the state of the application to the state of the save‐ point and run the application from the point at which the savepoint was taken.
zh_cn: 这样就能用保存点内的数据初始化状态并从生成保存点的那一刻继续运行应用。

source: This window type essentially represents a time interval between the two timestamps, where start is
zh_cn: 该窗口类型实际上表示两个时间戳之间的时间区间（左闭右开）。

source: This works because broadcasting state ensures that all tasks have the same state.
zh_cn: 这样做的原因是广播状态能确保所有任务的状态相同。

source: This yields a self- contained, yet typically quite large, application JAR file.
zh_cn: 这样会生成一个独立但通常很大的应用JAR文件。

source: Threads are more lightweight than separate processes and have lower communication costs but do not strictly isolate tasks from each other.
zh_cn: 和独立进程相比，线程更加轻量并且通信开销更低，但无法严格地将任务彼此隔离。

source: Through Kafka 0.11, the API of the client library evolved and new features were added, such as record timestamp support with Kafka 0.10 and transactional writes with Kafka 0.11.
zh_cn: Kafka在0.11版本以前，其客户端库的API一直在改变且经常添加一些新的功能，例如它在0.10版本开始支持记录时间戳，在0.11版本开始支持事务性写。

source: Through Kafka 0.11, the API of the client library evolved and new features were added.
zh_cn: Kafka在0.11版本以前，其客户端库的API一直在改变且经常添加一些新的功能。

source: Throughput
zh_cn: 吞吐

source: Throughput is a measure of the system’s processing capacity, i.e. its rate of processing.
zh_cn: 吞吐是用来衡量系统处理能力（处理速率）的指标，

source: Throughput is a measure of the system’s processing capacity—its rate of processing.
zh_cn: 吞吐是用来衡量系统处理能力（处理速率）的指标，

source: Throughput is measured in events or operations per time unit.
zh_cn: 吞吐的衡量方式是计算每个单位时间的事件或操作数。

source: Thus, an event might belong to multiple buckets.
zh_cn: 这意味着每个事件可能会同时属于多个桶。

source: Thus, for applications where speed is more important than accuracy, processing time comes handy.
zh_cn: 因此对于那些更重视处理速度而非准确度的应用而言，处理时间用起来很方便。

source: Thus, for applications where speed is more important than accuracy, processing time comes in handy.
zh_cn: 因此针对那些更重视处理速度而非准确度的应用，处理时间就会派上用场。

source: Thus, the latency is bounded by the arrival time of the last event in each batch and naturally depends on the batch size.
zh_cn: 因此处理延迟受制于每个批次最迟事件的时间，且天然依赖批次大小。

source: Thus, you wait in line and when it is your turn you make an order.
zh_cn: 这时候你就需要排队，等轮到你的时候再开始点单。

source: Thus, you wait in line and when it is your turn you place an order.
zh_cn: 这时候你就需要排队，等轮到你的时候再开始点单。

source: Time Semantics
zh_cn: 时间语义

source: Time Semantics | 27
zh_cn: 时间语义 | 27

source: Time is perhaps the most important aspect of stream processing.
zh_cn: 时间可能是流处理中最重要的一个方面。

source: Time semantics
zh_cn: 时间语义

source: Time to get our hands dirty and start developing Flink applications!
zh_cn: 是时候撸起袖子着手开发Flink应用了！

source: Time windows have a start and an end timestamp.
zh_cn: 每个时间窗口都有一个开始时间戳和一个结束时间戳。

source: Time- based tumbling windows define a time interval during which events are buffered in the bucket.
zh_cn: 基于时间的（time-based）滚动窗口定义了在桶中缓冲数据的时间间隔。

source: Time-Based and Window Operators
zh_cn: 基于时间和窗口的算子

source: Time-Based and Window Operators.
zh_cn: 基于时间和窗口的算子

source: Time-based and Window Operators.
zh_cn: 基于时间和窗口的算子

source: Time-based operators use this time to trigger computations and make progress.
zh_cn: 基于时间的算子会使用这个时间来触发计算并推动进度前进。

source: Time-based tumbling window
zh_cn: 基于时间的滚动窗口

source: Time-based tumbling window.
zh_cn: 基于时间的滚动窗口。

source: Time-based tumbling windows define a time interval during which events are buffered in the bucket.
zh_cn: 基于时间的（time-based）滚动窗口定义在桶中缓冲数据的时间间隔。

source: Time-based window assigners assign an element based on its event-time timestamp or the current processing time to windows.
zh_cn: 基于时间的窗口分配器会根据元素事件时间的时间戳或当前处理时间将其分配到一个或多个窗口。

source: Time-related operators such as window operators and other specialized trans‐ formations are described in later chapters.
zh_cn: 基于时间的算子（如窗口算子）以及其他一些特殊转换会在后面章节介绍。

source: Time.of(30, TimeUnit.SECONDS) // delay between attempts
zh_cn: Time.of(30, TimeUnit.SECONDS) // 尝试之间的延迟

source: TimerService and Timers
zh_cn: 时间服务和计时器

source: Timers are always asynchronously checkpointed, with one exception.
zh_cn: 计时器通常会以异步方式存入检查点，但有一个例外：

source: Timers are checkpointed along with any other state of the function.
zh_cn: 这些计时器会和其他状态一起写入检查点。

source: Timers can be based on event time or processing time.
zh_cn: 计时器可以基于事件时间或处理时间。

source: Timers can only be registered on keyed streams.
zh_cn: 计时器只允许在按键值分区的数据流上注册。

source: Timers of a trigger
zh_cn: 触发器计时器

source: Timers on Nonkeyed Streams
zh_cn: 在非键值分区流上设置计时器

source: Timers that are registered for a timestamp in the past are not silently dropped but processed as well.
zh_cn: 以过去的时间戳注册的计时器不会被静默地删除，而同样会被处理。

source: Timestamp Assignment and Watermark Generation
zh_cn: 时间戳分配和水位线生成

source: Timestamp assigners behave like other transformation operators.
zh_cn: 时间戳分配器的工作原理和其他转换算子类似。

source: Timestamp assigners do not change the data type of a DataStream.
zh_cn: 时间戳分配器不会改变DataStream的数据类型。

source: Timestamps
zh_cn: 时间戳

source: Timestamps and watermarks are specified in milliseconds since the epoch of 1970-01-01T00:00:00Z.
zh_cn: 时间戳和水位线都是利用自1970-01-01 00:00:00以来的毫秒数指定。

source: Timestamps and watermarks are usually assigned and generated when a stream is ingested by a streaming application.
zh_cn: 时间戳和水位线通常都是在数据流刚刚进入流处理应用的时候分配和生成的。

source: Timestamps and watermarks can be assigned and generate by a
zh_cn: 它们可以通过一个专门的TimestampAssigner（请参阅"分配时间戳和生成水位线"一节）或在数据源函数中完成。

source: Timestamps and watermarks for event-time applications
zh_cn: 事件时间应用中的时间戳和watermark

source: Timestamps and water‐ marks can be either assigned and generated by a SourceFunction or using an explicit user-defined timestamp assigner and watermark generator.
zh_cn: 时间戳分配和水位线生成既可以通过SourceFunction，也可以显式使用一个用户自定义时间戳分配和水位线生成器。

source: Timestamps usually exist inside the event data before they enter the processing pipeline (e.g. event cre‐ ation time).
zh_cn: 这些时间戳通常在事件数据进入流处理管道之前就存在（例如：事件生成时间）。

source: Timestamps usually exist inside the event data before they enter the processing pipeline (e.g., the event creation time).
zh_cn: 这些时间戳通常在事件数据进入流处理管道之前就存在（例如事件的创建时间）。

source: To access the createTypeInformation macro function, make sure to
zh_cn: 为了使用createTypeInformation宏函数，

source: To assess end-to-end guarantees, one has to consider all the components of an application pipeline.
zh_cn: 为了评估它，需要考虑应用处理管道上的所有组件。

source: To avoid long-running checkpoints, you can configure a timeout interval after which a checkpoint is canceled.
zh_cn: 为了避免检查点生成时间过长，你可以配置一个超时间隔，在该间隔过后生成操作会被取消。

source: To avoid such behavior, a source function can generate watermarks for each stream partition independently and always emit the smallest watermark of its partitions as its watermark.
zh_cn: 为了避免该情况，数据源函数可以为每个数据流分区独立生成水位线，并将它们中的最小值作为整条数据流的水位线发出。

source: To avoid such risk, you should make sure that scope identifiers per job are
zh_cn: 为了避免类似状况，你需要确保每个作业的域标识都是唯一的。

source: To be able to catch up with the stream—reach its tail—the application must process the accumulated data at a higher rate than new data is arriving.
zh_cn: 为了能够追赶上数据流（到达其尾部），应用处理积累数据的速率必须要高于新数据到来的速率。

source: To better understand the con‐ cept of peak throughput, let us consider that system resources are completely unused.
zh_cn: 为了更好地理解峰值吞吐的概念，我们假设系统资源完全空闲。

source: To better understand the con‐ cept of peak throughput, let’s consider a stream processing application that does not receive any incoming data and thus does not consume any system resources.
zh_cn: 为了更好地理解峰值吞吐的概念，我们先假设某个流处理应用没有在接收任何数据，也因此无需占用任何系统资源。

source: To build an image with Flink 1.7.1 that contains the example applications of this book, execute the script as follows:
zh_cn: 如果要构建一个包含了本书示例应用的Flink 1.7.1版本镜像，请执行以下脚本：

source: To cancel a running application without taking a savepoint run the following command:
zh_cn: 如果要在不使用保存点的情况下取消当前运行的应用，请运行以下命令：

source: To change the properties of log4j loggers, modify the log4j.properties file in the conf/
zh_cn: 要修改log4j记录器的属性，请修改conf/目录中的log4j.properties文件。

source: To check if the request with the ID ebde90836b8b9dc2da90e9e7655f4179 was suc‐ cessful and to retrieve the path of the savepoint run:
zh_cn: 可以通过以下命令检查ID为ebde90836b8b9dc2da90e9e7655f4179的请求是否成功并获取保存点的路径：

source: To create a state object, we have to register a StateDescriptor with Flink’s runtime via the RuntimeContext, which is exposed by RichFunction (see “Implementing Functions” on page 105 for a discussion of the RichFunction interface).
zh_cn: 为了创建一个状态对象，我们需要利用RichFunction（有关该接口的内容请参照105页"实现函数"）中的RuntimeContext在Flink运行时中注册一个StateDescriptor。

source: To create a window operator, you need to specify two window components:
zh_cn: 为了新建一个窗口算子需要指定两个窗口组件：

source: To date, more than five hundred individu‐ als have contributed to Flink, and it has evolved into one of the most sophisticated open source stream processing engines as proven by its widespread adoption.
zh_cn: 截至目前，该项目已经有超过500名贡献者，并在不断普及的过程中逐渐发展为开源界最为先进的流处理引擎之一。

source: To define time operations in a distributed stream processing application, it is impor‐ tant to understand the meaning of time.
zh_cn: 为了在分布式流处理应用中定义时间操作，准确理解时间的含义非常关键。

source: To disable chaining for a specific operator,
zh_cn: 例如，可以通过调用算子的disableChaining()方法禁用其链接功能。

source: To dispose a savepoint use the REST call that is shown in Table 10-15 .
zh_cn: 请使用表10-15中的REST调用删除保存点。

source: To dispose a savepoint with curl, run:
zh_cn: 要使用curl删除某个保存点，请运行：

source: To enable latency tracking, you need to configure how often latency markers are emitted from the sources.
zh_cn: 为了启用延迟追踪，你需要配置从数据源发出延迟标记的频率。

source: To ensure an application can make enough progress, you can configure a minimum pause between checkpoints.
zh_cn: 为了保证应用可以取得足够多的进展，Flink允许你配置一个检查点之间的最小暂停时间。

source: To ensure that event-time operations behave as expected, the assigner should be called before any event-time dependent transformation (e.g., before the first event- time window).
zh_cn: 为了保证事件时间相关操作能够正常工作，必须将分配器放在任何依赖事件时间的转换之前（例如在第一个事件时间窗口之前）。

source: To guarantee exactly-once output, Flink must recover from the latest completed checkpoint or savepoint.
zh_cn: 为了确保精确一次输出，Flink需要从最近一次的检查点或保存点恢复。

source: To help users start a ZooKeeper cluster quickly for testing purposes, Flink provides a helper script for bootstrapping.
zh_cn: 为了帮助用户快速启动ZooKeeper集群进行测试，Flink提供了一个自启动帮助脚本。

source: To illustrate the use of the Cassandra sink connector, we use the simple example of a Cassandra table that holds data about sensor readings and consists of two columns,
zh_cn: 为了说明Cassandra数据汇连接器的使用方法，我们以一个简单的Cassandra表为例，表中包含了两个列，分别用来保存传感器读数的传感器ID和温度。

source: To improve the out-of-the-box experience, Flink is preconfigured for a local setup.
zh_cn: 为了让用户快速上手，Flink已经预先配置好本地运行模式。

source: To install either of both connectors, move the respective JAR file from the ./opt folder into the ./lib folder.
zh_cn: 要安装它们中的一个，请将对应的JAR文件从./opt文件夹移动到./lib中。

source: To keep the example concise, we create a new JDBC connection for each record, which is, of
zh_cn: 出于简洁考虑，我们在示例中为每条记录都创建了一个新的JDBC连接，

source: To key the stream by sensor ID we can pass the field name id to the keyBy() func‐ tion:
zh_cn: 为了将传感器ID设为数据流的键值，我们可以把字段名称id传给keyBy()函数：

source: To limit the state size, operators usually maintain some kind of summary or synopsis of the events seen so far.
zh_cn: 为了限制状态大小，算子通常都会只保留到目前为止所见事件的摘要或概览。

source: To overcome this problem, Flink supports a high-availability mode that migrates the responsibility and metadata for a job to another JobManager in case that the original JobManager disappears.
zh_cn: 为了解决该问题，Flink提供了高可用模式，支持在原JobManager消失的情况下将作业的管理职责及元数据迁移到另一个JobManager。

source: To over‐ come this problem, Flink supports a high-availability mode that migrates the respon‐ sibility and metadata for a job to another JobManager in case the original JobManager disappears.
zh_cn: 为了解决该问题，Flink提供了高可用模式，支持在原JobManager消失的情况下将作业的管理职责及元数据迁移到另一个JobManager。

source: To produce a result, a UDF accumulates state over a period or number of events, e.g. to compute an aggregation or detect a pattern.
zh_cn: 为了生成结果，UDF会在一段时间或基于一定个数的事件来累积状态，如：计算聚合或检测某个模式。

source: To produce a result, a function accumulates state over a period of time or number of events (e.g., to compute an aggregation or detect a pattern).
zh_cn: 为了生成结果，函数会在一段时间或基于一定个数的事件来累积状态（例如计算聚合或检测某个模式）。

source: To prop‐ erly define window operator semantics, we need to answer two main questions: “how are events assigned to buckets?” and “how often does the window produce a result?”.
zh_cn: 为了准确定义窗口算子语义，我们需要回答两个核心问题："事件如何分配到桶中"以及"窗口以什么频率产生结果"。

source: To prop‐ erly define window operator semantics we need to determine both how events are assigned to buckets and how often the window produces a result.
zh_cn: 为了准确定义窗口算子语义，我们需要决定事件如何分配到桶中以及窗口以怎样的频率产生结果。

source: To recap, processing time offers low latency but results depend on the speed of processing and are not deterministic.
zh_cn: 总之，虽然处理时间提供了很低的延迟，但它的结果依赖处理速度，具有不确定性。

source: To recover from fail‐ ures, the system needs to deal with two aspects.
zh_cn: 为了从故障中恢复，系统需要做两手处理：

source: To recover from fail‐ ures, the system first needs to restart failed processes, and second, restart the applica‐ tion and recover its state.
zh_cn: 为了从故障中恢复，系统首先要重启故障进程，随后需要重启应用并恢复其状态。

source: To register metrics you have to retrieve a MetricGroup by calling the getMetrics()
zh_cn: 为了注册指标，你需要像示例10-5那样调用RuntimeContext的getMetrics()方法获取一个MetricGroup对象。

source: To rescale an application with curl to a new default parallelism of 16 run:
zh_cn: 要使用curl将应用的默认并行度调整为16，请运行：

source: To rescale the application with the jobId bc0b2ad61ecd4a615d92ce25390f61ad to a parallelism of 16, run the command:
zh_cn: 为了将JobId为bc0b2ad61ecd4a615d92ce25390f61ad的应用设置为并行度等于16，你可以运行以下命令：

source: To retrieve one or more metrics for a TaskManager, add the get query parameter with all the requested metrics to the request:
zh_cn: 为了得到一个或多个TaskManager指标，请将它们以get查询参数的形式加入到请求中：

source: To set a custom filename and location of this file, pass the -Dlog4j.configuration= parameter to the JVM. Flink also provides the log4j-cli.properties file used by the
zh_cn: 如果要使用自定义文件名和位置的配置文件，可以通过-Dlog4j.configuration=parameter的方式将参数传递给JVM。Flink还为命令行客户端提供了log4j-cli.properties文件，

source: To some extent, the latency can be reduced by importing data into the data store with data pipeline applications.
zh_cn: 在某种程度上，使用数据管道应用来导入数据可以降低延迟。

source: To some extent, the latency can be reduced by importing data into the datastore with a data pipeline application.
zh_cn: 在某种程度上，使用数据管道应用来导入数据可以降低延迟。

source: To start an application, you first need to upload the application’s JAR file to the cluster.
zh_cn: 要启动一个应用，你必须先将应用的JAR文件传到集群。

source: To start the application, run the main() method.
zh_cn: 直接运行它就能启动应用。

source: To structure a typical Flink streaming application:
zh_cn: 构建一个典型的Flink流式应用需要以下几步：

source: To trigger a savepoint for the job bc0b2ad61ecd4a615d92ce25390f61ad and store it in the directory hdfs:///xxx:50070/savepoints, we call the command-line client:
zh_cn: 我们可以像下面那样调用命令行客户端来为作业bc0b2ad61ecd4a615d92ce25390f61ad生成一次保存点，并将其存储到hdfs:///xxx:50070/savepoints目录中：

source: To understand latency intuitively, consider your daily visit to your favorite coffee shop.
zh_cn: 为了直观地理解延迟，想一下你每天都会光顾自己喜欢的咖啡店。

source: To use a Gauge you implement the org.apache.flink.metrics.Gauge interface and register it using the gauge(String name, Gauge gauge) method on MetricGroup.
zh_cn: 要使用Gauge，你需要实现org.apache.flink.metrics.Gauge接口并利用MetricGroup的gauge(String name, Gauge gauge)方法将其注册。

source: To use logback instead of log4j, you will need to remove log4j from the lib/ folder.
zh_cn: 如果要用logback，需要从lib/文件夹中移除log4j。

source: To use timers on a nonkeyed stream, you can create a keyed stream by
zh_cn: 为了在一条非键值分区的数据流上使用计时器，你可以通过在KeySelector中返回一个"假冒的"常数键值来创建一条键值分区数据流。

source: Today, components of the Apache Hadoop ecosystem are integral parts in the IT infrastructures of many enterprises and companies.
zh_cn: 时至今日，Apache Hadoop生态组件已经成为很多公司和企业IT基础架构中举足轻重的部分。

source: Today, components of the Apache Hadoop ecosystem are integral parts in the IT infrastructures of many enterprises.
zh_cn: 时至今日，Apache Hadoop生态组件已经成为很多公司和企业IT基础设施中举足轻重的部分。

source: Today, distributed open source stream processors power business-critical applications in many enterprises across dif‐ ferent industries such as (online) retail, social media, telecommunication, gaming, and banking.
zh_cn: 如今，开源分布式流处理引擎已经支撑起包括（在线）零售、社交媒体、移动通信、游戏、银行等很多不同行业的核心业务应用。

source: Today, dis‐ tributed open source stream processors power business-critical applications in many
zh_cn: 如今，开源分布式流处理引擎已经支撑起包括（在线）零售、社交媒体、移动通信、游戏、银行等很多不同行业的核心业务应用。

source: Today’s IT architectures include many different data stores, such as relational and special-purpose database systems, event logs, distributed file systems, in-memory caches, and search indexes.
zh_cn: 今日的IT架构通常会涵盖多种不同的数据存储，例如：关系型或专用数据库系统、事件日志系统、分布式文件系统、内存缓存、搜索索引等。

source: Today’s IT architectures include many different datastores, such as relational and special-purpose database systems, event logs, distributed filesystems, in-memory caches, and search indexes.
zh_cn: 如今的IT架构通常会包含多种不同的数据存储，例如：关系型或专用数据库系统、事件日志系统、分布式文件系统、内存缓存及搜索索引等。

source: Today’s data infrastructures are diverse.
zh_cn: 现如今，数据基础架构纷繁多样。

source: Traditional Data Infrastructures
zh_cn: 传统数据处理架构

source: Traditional Data Infrastructures | 3
zh_cn: 传统数据处理架构 | 3

source: Traditional analytics pipelines consist of several individual components such as an ETL process, a storage system, and in case of a Hadoop-based environment also a data processor and scheduler to trigger jobs or queries.
zh_cn: 传统分析流水线包含了很多独立组件，例如：ETL进程、存储系统等。即便是基于Hadoop的环境，也需要有数据处理器和用来触发作业或查询的调度器。

source: Traditional analytics pipelines consist of several individual components such as an ETL process, a storage system, and in the case of a Hadoop-based environment, a data processor and scheduler to trigger jobs or queries.
zh_cn: 传统分析流程包含了很多独立组件，例如ETL进程、存储系统等。即便是基于Hadoop的环境，也需要有数据处理器和用来触发作业或查询的调度器。

source: Traditional batch oriented architectures are not able to address such use cases.
zh_cn: 面向批次的传统架构根本无力应对它们。

source: Traditional design of transactional applications that store data in a remote database system
zh_cn: 将数据存储在远程数据库系统内的传统事务型应用设计

source: Transactional Processing
zh_cn: 事务型处理

source: Transactional Sink Connectors
zh_cn: 事务性数据汇连接器

source: Transactional Writes
zh_cn: 事务性写

source: Transactional applications
zh_cn: 事务型应用

source: Transactional updates are one way to achieve this result, but they can incur substantial performance overhead.
zh_cn: 事务性更新是实现该目标的一个方法，但它可能会带来极大的性能开销。

source: Transactional updates is one way to achieve this result, however, it can incur substantial performance over‐ head.
zh_cn: 事务性更新是达到该结果的一个方法，但它可能会带来极大的性能开销。

source: TransactionalFileSink in Example 8-15 creates a new transaction file and returns its name as the identifier.
zh_cn: 示例8-15中的TransactionalFileSink会创建一个新的事务文件并返回它的名字作为标识符。

source: Transformation operations
zh_cn: 转换操作

source: Transformation operations are single-pass operations that process each event inde‐ pendently.
zh_cn: 转换操作是一种"单向"操作，会独立处理每个事件。

source: Transformations
zh_cn: 转换操作

source: Transformations and rolling aggregations process one event at a time to produce out‐ put events and potentially update state.
zh_cn: 转换操作和滚动聚合每次处理一个事件来产生输出并（可能）更新状态。

source: Transformations | 85
zh_cn: 转换操作 | 85

source: TriggerResult can take one of the following values:
zh_cn: TriggerResult可以是以下值之一：

source: Triggers
zh_cn: 触发器

source: Triggers define when a window is evaluated and its results are emitted.
zh_cn: 触发器用于定义何时对窗口进行计算并发出结果。

source: Triggers have access to time properties and timers, and can work with state.
zh_cn: 触发器不仅能够访问时间属性和计时器，还可以使用状态，

source: True stream processing does not introduce such artificial delays and therefore can achieve really low latencies.
zh_cn: 真正的流处理不会引入人为推迟等要素，因此才能实现极低的延迟。

source: True stream processing does not intro‐ duce such artificial delays and thus can achieve really low latencies.
zh_cn: 真正的流处理不会引入人为延迟等要素，只有这样才能将延迟将至极低。

source: Tumbling windows assign events into non-overlapping buckets of fixed size. When the window border is passed, all the events are sent to an evaluation func‐ tion for processing.
zh_cn: 滚动窗口（tumbling window）将事件分配到长度固定且互不重叠的桶中。在窗口边界通过后，所有事件会发送给计算函数处理。

source: Tumbling windows
zh_cn: 滚动窗口

source: Tumbling windows assign events into nonoverlapping buckets of fixed size.
zh_cn: 滚动窗口（tumbling window）将事件分配到长度固定且互不重叠的桶中。

source: Tuning Checkpointing and Recovery
zh_cn: 调整检查点及恢复

source: Tuning Checkpointing and Recovery | 263
zh_cn: 调整检查点和恢复 | 263

source: Tuple fields are referenced either by their field name (1-offset for Scala tuples, 0-offset for Java tuples) or by their 0-offset field index:
zh_cn: 元组字段的引用既可以利用字段名称（Scala元组编号从1开始，Java元组编号从0开始），也可以利用从0开始的字段索引：

source: Tuple fields can be accessed by the name of their public fields—f0, f1, f2, etc., as shown earlier—or by position using the getField(int pos) method, where indexes start at 0:
zh_cn: 元组中的各个字段可以向上面那样通过公有字段名称（f0、f1、f2等）访问，也可以使用getField(int pos)方法通过位置访问，位置下标从0开始。

source: Tuples are composite data types that consist of a fixed number of typed fields.
zh_cn: 元组是由固定数量的类型字段所组成的复合数据类型。

source: Two tasks of a sum operator compute the running sums of all even and odd numbers.
zh_cn: 求和算子的两个任务会分别对它们求和。

source: TwoPhaseCommitSinkFunction[IN, TXN, CONTEXT] has three type parameters:
zh_cn: TwoPhaseCommitSinkFunction[IN, TXN, CONTEXT]需要三个类型参数：

source: Type Information in the Scala API
zh_cn: Scala API中的类型信息

source: TypeInformation’s helper class is org.apache.flink.api.scala.typeutils.Types
zh_cn: Scala API中有关TypeInformation的辅助类是org.apache.flink.api.scala.typeutils.Types，

source: Types
zh_cn: 类型

source: Types that are not specially handled are treated as generic types and serialized using the Kryo serialization framework.
zh_cn: 那些无法特别处理的类型会被当做泛型类型交给Kryo序列化框架进行序列化。

source: Types | 101
zh_cn: 类型系统 | 101

source: Typical real-world setups can easily have hundreds of such tasks running in parallel on many physical machines.
zh_cn: 不少实际系统设置都可以轻松做到在很多物理机器上并行运行数以百计的任务。

source: Typical use cases for event-driven applications include
zh_cn: 事件驱动型应用的典型应用场景有：

source: Typical use cases for event-driven applications include:
zh_cn: 事件驱动型应用的典型应用场景有：

source: Typical use cases for streaming analytics applications are
zh_cn: 典型的流式分析用例包括：

source: Typically, a database system serves multiple applications which often even access the same databases or tables.
zh_cn: 通常情况下，多个应用会共用一个数据库系统，更有甚者，这些应用会访问相同的数据库或表。

source: Typically, an external resource manager such as Kubernetes takes care of starting the images and ensures that containers are restarted in case of a failure.
zh_cn: 通常情况下，外部资源管理器（如：Kubernetes）负责启动镜像，并确保在发生故障时可以重启容器。

source: Typically, an external resource manager such as Kubernetes takes care of starting the images and ensuring that of each type a certain number of containers is running.
zh_cn: 通常情况下，是由外部资源管理器（如：Kubernetes）负责启动映像，并各类型容器都以指定数量运行。

source: Typically, external systems, such as Kafka, only guarantee message order within a stream partition.
zh_cn: 通常情况下，像Kafka这样的外部系统只能保证单个数据流分区的消息顺序。

source: Typically, streaming applications store their result in an external data store that supports efficient updates, such as a database or key-value store.
zh_cn: 通常情况下，流式应用会把它们的结果保存在某种支持高效更新的外部数据存储中，例如数据库或键值存储。

source: Typically, the state handle object is created in the open() method of RichFunction.
zh_cn: 通常情况下，状态句柄对象要在RichFunction的open()方法中创建。
